<a href="https://colab.research.google.com/github/maithstartup/Notebooks-Practical-ML-Beginners/blob/master/pandas/reading_and_writing_to_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
!pip install wget

Requirement already satisfied: wget in /usr/local/lib/python3.6/dist-packages (3.2)

In [3]:
!pip install xlsxwriter xlrd

Requirement already satisfied: xlsxwriter in /usr/local/lib/python3.6/dist-packages (1.2.9)
Requirement already satisfied: xlrd in /usr/local/lib/python3.6/dist-packages (1.1.0)

In [4]:
import wget

In [5]:
wget.download("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")

'titanic.csv'

In [6]:
df=pd.read_csv("titanic.csv" )

In [7]:
df.head(10)

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500
5         0       3  ...                       0   8.4583
6         0       1  ...                       0  51.8625
7         0       3  ...                       1  21.0750
8         1       3  ...                       2  11.1333
9         1       2  ...                       0  30.0708

[10 rows x 8 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [9]:
df.dtypes

Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

In [10]:
df.describe()

         Survived      Pclass  ...  Parents/Children Aboard       Fare
count  887.000000  887.000000  ...               887.000000  887.00000
mean     0.385569    2.305524  ...                 0.383315   32.30542
std      0.487004    0.836662  ...                 0.807466   49.78204
min      0.000000    1.000000  ...                 0.000000    0.00000
25%      0.000000    2.000000  ...                 0.000000    7.92500
50%      0.000000    3.000000  ...                 0.000000   14.45420
75%      1.000000    3.000000  ...                 0.000000   31.13750
max      1.000000    3.000000  ...                 6.000000  512.32920

[8 rows x 6 columns]

In [11]:
df2=pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv", usecols=[0,2,3])

In [12]:
df2.head()

   Survived                                               Name     Sex
0         0                             Mr. Owen Harris Braund    male
1         1  Mrs. John Bradley (Florence Briggs Thayer) Cum...  female
2         1                              Miss. Laina Heikkinen  female
3         1        Mrs. Jacques Heath (Lily May Peel) Futrelle  female
4         0                            Mr. William Henry Allen    male

In [13]:
df2=pd.read_csv("titanic.csv",skiprows=[1,2,3])

In [14]:
df2.head()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         1       1  ...                       0  53.1000
1         0       3  ...                       0   8.0500
2         0       3  ...                       0   8.4583
3         0       1  ...                       0  51.8625
4         0       3  ...                       1  21.0750

[5 rows x 8 columns]

In [15]:
df3=pd.read_excel("tankreadingsprediction.xlsx")

In [16]:
df3.tail(3)

                    Time           Tank   tankvolume
9860 2020-02-05 12:38:00  13829735305817  202.731299
9861 2020-02-05 13:38:00  13829735305817  202.731299
9862 2020-02-05 13:48:00  13829735305817  202.731299

In [17]:
df2=pd.DataFrame({"age":[18,20,21],"gender":["Male","Female","Male"]},[2001,2002,2003] )

In [18]:
df2

      age  gender
2001   18    Male
2002   20  Female
2003   21    Male

In [19]:
df2.to_excel("fruits.xlsx",sheet_name="list1" )

In [ ]:
df2

In [20]:
df2.to_csv("fruits.csv")

In [21]:
df2.to_csv( "fruits1.csv",index=False )

In [22]:
df2.to_csv( "fruits2.csv",index=False,header=False )

[To Explore more](https://pandas.pydata.org/pandas-docs/stable/user_guide/index.html)